package org.example.lesson21;

public class Lesson21 {
    /**
     * Результаты для массива длинной в 100 000 000
     * Процессор в 4 ядра и 8 логических процессоров.
     *
     * Количество потоков: время выполнения
     *
     * Результаты для общего замера работы
     * 1: 10913, 10978, 11015 ~ 11сек.
     * 2: 5920, 5793, 5857 ~ 6сек.
     * 4: 4011, 3772, 3908 ~ 4сек.
     * 8: 2899, 2971, 3048 ~ 3сек.
     * 16: 3013, 3001, 3084 ~ 3сек.
     *
     * Результаты только для работы тредов
     * 1: 10014, 10108, 10072 ~ 10сек.
     * 2: 5020, 4931, 4992 ~ 5сек.
     * 4: 3100, 2861, 2990 ~ 3сек.
     * 8: 1926, 1975, 2051 ~ 2сек.
     * 16: 1898, 2021, 2016 ~ 2сек.
     *
     * @param args
     */
    public static void main(String[] args) {
        ValueCalculator valueCalculator = new ValueCalculator();
        valueCalculator.doCalc(100000000, 16);
    }
}
